export const FIGURE_TYPES = 'узнать о типах внешности';
export const DRESS_CODES = 'узнать о дресс-кодах';
export const CHECK_FIGURE_TYPE = 'определить свой тип внешности';
export const METHODICAL_DESCRIPTION = 'узнать о принципах';
export const INTRO = 'помощь';
export const START = 'поехали';

export const TTL_SEX = 'Выберите пол';
export const TTL_SHOULDERS = 'Укажите ширину спины';
export const TTL_HIPS = 'Укажите обхват бёдер';
export const TTL_WAIST = 'Укажите обхват талии';
export const TTL_CHEST = 'Укажите обхват груди';
export const TTL_HEIGHT = 'Укажите ваш рост';
export const TTL_SHOE_SIZE = 'Укажите размер обуви';
export const TTL_FAT_PERCENTAGE = 'Определите показатель жира по картинке';
export const TTL_DRESS_CODE = `Далее мы можем приступить к подбору одежды. Потребуется выбрать желаемый дресс-код и тип одежды (верхняя одежда, основная и т. д.)`;

export const TXT_DRESS_CODE = `Смокинг не очень подходит для повседневной поездки на метро, даже если он очень очень Вам идёт. Каждой одежде своё применение. Для этого вводится понятие "дресс-код", позволяющее разделить наряды на группы по степени формальности. Ниже приводятся описания дресс-кодов. В конце можно выбрать тот, который интересует Вас`;

export const TXT_DRESS_CODES = `В спортивной одежде не пойти на светский раут, даже если треники с тремя полосами вам идут, как никому другому. Согласитесь также, что в прекрасно сидящем на вас смокинге не стоит идти на футбольный матч. Одежда должна не только хорошо подходить вам, но и должна подходить мероприятию, на которое вы собираетесь в ней пойти. Здесь помогает понятие о дресс-кодах - ранжирование костюмов но степени их строгости и формальности. В рамках каждого выработаны определённые образы, накладывающие свои требования к внешности надевающего костюм.`;

export const TXT_METHODICAL_DESCRIPTION = `Прежде чем приступить к работе, будет не лишним прояснить один важный вопрос: по какому принципу даются советы по подбору одежды? Если одежда старается подчёркнуть достоинства и скрыть недостатки, то на основании чего те или иные черты внешности оцениваются, как достоинства, и, как недостатки? Кого-то может сказать об идеальных пропорциях и что, сравнение с идеалом и есть главный способ оценки внешности. Однако, это большое заблуждение. Наряд, как явление культуры, тяготеют к тем или иным образам, меняющимся во времени, а не какому-то каноничному идеалу. К примеру, в тридцатые годы прошлого века, когда бушевал экономический кризис, известный, как “великая депрессия”, женская мода обладала особой приметой - широкие плечи в одежде. Наряды нарочно даже шилась в области плеч шире, часто использовались подплечники. Это подтвердят некоторые из костюмов Марлен Дитрих или работы модельера Жана Пату, относящиеся к тому периоду. Узкие плечи или даже плечи, равные ширине бёдер, считались недостатком, требующим коррекции. Сегодня, когда такого культа широких плеч уже нет, слова выше могут показаться странными, но тогда был выработан вполне гармоничный женский образ. В связи с этим, достоинства и недостатки внешности определяются не золотыми сечениями, а контекстом, в качестве которого выступает принятая мода, или, точнее, массовая мода. 
Советы по подбору одежды, которые будут даны после определения типа фигуры, ориентируются на бытующие сегодня образы, существующие в рамках дресс-кодов, и исходят из предложения рынка готовой одежды.`;

export const TXT_CHECK_FIGURE_TYPE = `Здесь вам предстоит снимать с себя мерки. Надеюсь, вы располагаете метром - лентой-линейкой. На худой конец, можете воспользоваться верёвкой и линейкой, правда это не очень удобно и точно. Помните, что некоторые виды одежды, как утягивающие колготки или добавляющие объём бюстгалтеры (если вы, конечно, женщина), могут существенно влиять на снимаемые размеры. Места, где следует прикладывать измерительную ленту приведены на рисунке. Также там отмечены характерные точки, к которым метр должен прилегать. Прилегать же он должен плотно, но не туго. Располагайте его, по возможности, горизонтально. Мерок будет четыре. Введите “Поехали”, если готовы.`;

export const TXT_FIGURE_TYPES = `Все мы уникальны - кто-то коренастый, кто-то вытянутый, одежда же в магазинах представлена висящей на манекенах, эдаких “стандартных людях”. Как быть уверенным, что представленная на манекене одежда будет сидеть на вас также хорошо? Без понимания, какая у вас фигура, здесь не обойтись. Это возможно сделать с помощью снятия мерок с тела с помощью метра. Введя команду “Определить свой тип внешности” вы можете ввести свои мерки в чат и узнать заключение по внешности. 
В нашей методике выделено пять базовых типов внешности. Они определяются по следующим характеристикам: 
1 отношение ширины бёдер к ширине спины или груди
2 выраженность талии в виде отношения средней талии к действительной. Средняя талия - это сумма ширины спины и ширины бёдер, делёная на два.
3 степень упитанности тела. Определяется качественно, не количественно.
Среди дополнительных параметров выступают удлинение и рост. Первое - это отношение роста к ширине спины, что показывает, на сколько человек вытянут. Если два человека обладают одинаковым ростом, но разным удлинением, то тот, у кого оно больше будет более широким. 
	Типы внешности производные от типов фигур, которых, на основании первых двух параметров, можно выделить девять. Границы диапазонов изменения параметров заданы на основе анализа внешнего восприятия фигур. Для некоторых из этих девяти типов, подходы в подборе совпадают, и они объединены в пять групп или типов внешности. Как показывает практика, не все характерные внешности можно описать таким способом. Есть люди одного типа внешности, но требующие разных подходов при подборе одежды. Разница между ними заключается в степени упитанности или величине подкожной жировой прослойки. Этот третий параметр делает по две подгруппы в четырёх из пяти типах внешности. На основе этих групп и подгрупп выделяются базовые рекомендации, которые могут сопровождаться дополнительными рекомендациями, зависящими от второстепенных характеристик.
Здесь, полагаю, следует вставить картинку таблицы из основного документа`;

export const TXT_INTRO = `Привет! Я стилист Юля, и я могу дать несколько советов, как подбирать одежду. Основное, чем я могу помочь - это рассказать о принципах подбора одежды, рассказать о дресс-кодах и определить тип внешности. 
В принципах подбора одежды рассказывается на основе каких воззрений и подходов составляются советы по подбору. Это не большая, но важная статья. Прочесть её можно с помощью команды “узнать о принципах”. 
Следующим пунктом идут дресс-коды (или стили). Это ранжирование одежды по степени её строгости и формальности. Чтобы узнать об этом подробнее, введите команду “узнать о дресс-кодах”
Тип внешности - набор связанных друг с другом особенностей тела, определяемых размерами его частей. От типа внешности зависит, как одежда смотрится на человеке. Узнать об этом подробнее можно узнать с помощью команды “узнать о типах внешности”
Можно, ничего не читая, сразу приступить к определению типа внешности и получению рекомендаций, как одеваться. Для этого введите команду “Определить свой тип внешности”.`;
